#### RailTransitionOption Enumeration

---

|  |
| --- |
| See Also |

The transition type of the continuous rail.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum RailTransitionOption ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration RailTransitionOption ``` |

| Visual C++ |
| --- |
| ``` public enum class RailTransitionOption ``` |

# Members

| Member name | Description |
| --- | --- |
| None | No transition. |
| Gooseneck | Gooseneck. |
| Simple | Simple |

# See Also

Autodesk.Revit.DB.Architecture Namespace